ATsupportum/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтрагенты_ат</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПодразделенияКлиентов_ат</name>
      <description>Контактная информация справочника &quot;Подразделения Клиентов&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьВводНекорректного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/Контрагенты_ат/Контрагенты_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты_ат</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОдинЭс</name>
      <description>1С</description>
    </items>
    <items>
      <name>Microsoft</name>
      <description>Microsoft</description>
    </items>
  </predefined>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъединятьНоменклатуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласованиеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяТемаУведомлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОЗадолженностях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВнутреннийКомментарийВHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ПараметрыКонтроляДанных_ат/ПараметрыКонтроляДанных_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыКонтроляДанных_ат</name>
  <predefined>
    <items>
      <name>ЗаполнятьОбщиеОбязательныеПоля</name>
      <description>Заполнять общие обязательные поля</description>
    </items>
    <items>
      <name>КонтролироватьЗаписьБизнесПроцессовИЗадач</name>
      <description>Контролировать запись бизнес процессов и задач</description>
    </items>
    <items>
      <name>КонтролироватьЗаписьДокументов</name>
      <description>Контролировать запись документов</description>
    </items>
    <items>
      <name>КонтролироватьЗаписьСправочников</name>
      <description>Контролировать запись справочников</description>
    </items>
    <items>
      <name>КонтролироватьНаименованияВСправочниках</name>
      <description>Контролировать наименования в справочниках</description>
    </items>
  </predefined>
  <attributes>
    <name>Исключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Документы</name>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
    </items>
    <items>
      <name>ПланыОбмена</name>
    </items>
    <items>
      <name>Подсистемы</name>
    </items>
    <items>
      <name>РегистрыНакопления</name>
    </items>
    <items>
      <name>РегистрыСведений</name>
    </items>
    <items>
      <name>Роли</name>
    </items>
    <items>
      <name>Справочники</name>
    </items>
    <items>
      <name>Отчеты</name>
    </items>
    <items>
      <name>Обработки</name>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
    </items>
    <items>
      <name>ПланыСчетов</name>
    </items>
    <items>
      <name>ПланыВидовРасчета</name>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
    </items>
    <items>
      <name>РегистрыРасчета</name>
    </items>
    <items>
      <name>БизнесПроцессы</name>
    </items>
    <items>
      <name>Задачи</name>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйСиноним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПустойСсылки</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъектаМетаданных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСсылка</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат/ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат</name>
  <comment>!!!rename</comment>
  <predefined>
    <items>
      <name>Другое</name>
      <description>Другое</description>
    </items>
    <items>
      <name>ИзмененоВСогласовании</name>
      <description>Изменено в согласовании</description>
    </items>
    <items>
      <name>ПозднееСогласование</name>
      <description>Позднее согласование</description>
    </items>
    <items>
      <name>ПоздняяОплатаСчета</name>
      <description>Поздняя оплата счета</description>
    </items>
  </predefined>
  <attributes>
    <name>ДобавлятьКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/CommonModules/ОбновлениеСаппорт_ат/Module.bsl
Процедура ЗаполнитьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеСаппорт_ат.НачальноеЗаполнение";
	
КонецПроцедуры

Процедура НачальноеЗаполнение() Экспорт
	
	ОбновитьПредопределенныеВидыКонтактнойИнформации();
	
	ВыполнитьНачальноеЗаполнениеСправочникаКонтрагенты_ат();
	ВыполнитьНачальноеЗаполнениеСправочникаСостоянияИБ_ат();
	ВыполнитьНачальноеЗаполнениеСправочникаСодержанияРабот_ат();	
	ВыполнитьНачальноеЗаполнениеСправочникаПараметрыКонтроляДанных_ат();
	ВыполнитьНачальноеЗаполнениеПВХОбъектыНумераторов_ат();
	
КонецПроцедуры 

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации()
	
	ПараметрыПроверкиАдреса = Новый Структура;
	ПараметрыПроверкиАдреса.Вставить("АдресТолькоРоссийский", Истина);
	ПараметрыПроверкиАдреса.Вставить("ПроверятьКорректность", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ЗапрещатьВводНекорректного", Ложь);
	ПараметрыПроверкиАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
	
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, НСтр("ru='Юридический адрес контрагента'"), Истина, Ложь, Ложь, 1, , ПараметрыПроверкиАдреса);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, НСтр("ru='Фактический адрес контрагента'"), Истина, Ложь, Ложь, 2);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru='Телефон контрагента'"), Истина, Ложь, Ложь, 3, Истина);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Факс, НСтр("ru='Факс контрагента'"), Истина, Ложь, Ложь, 4, Истина);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, НСтр("ru='Адрес электронной почты контрагента'"), Истина, Ложь, Ложь, 5, Истина);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, НСтр("ru='Почтовый адрес контрагента'"), Истина, Ложь, Ложь, 6);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Другое, НСтр("ru='Любая другая контактная информация'"), Истина, Ложь, Ложь, 7);
	
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailПользователяДляУведомлений,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, НСтр("ru='Адрес электронной почты для уведомлений'"), Истина,
		Ложь, Ложь, , Истина);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailПользователяДляФинансовыхДокументов,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, НСтр("ru='Адрес электронной почты для финансовых документов'"), Истина, Ложь, Ложь, , Истина);
	
КонецПроцедуры

Процедура ВыполнитьНачальноеЗаполнениеСправочникаКонтрагенты_ат()
	
	ОдинЭс = Справочники.Контрагенты_ат.ОдинЭс.ПолучитьОбъект();
	ОдинЭс.Поставщик = Истина;
	ОдинЭс.Записать();
	
КонецПроцедуры 

Процедура ВыполнитьНачальноеЗаполнениеСправочникаСостоянияИБ_ат()
	
	СостояниеИБ = Справочники.СостоянияИБ_ат.СоздатьЭлемент();
	СостояниеИБ.Наименование = "Тестовая ИБ";
	СостояниеИБ.Записать();
	
	СостояниеИБ = Справочники.СостоянияИБ_ат.СоздатьЭлемент();
	СостояниеИБ.Наименование = "Временная ИБ";
	СостояниеИБ.Записать();

	СостояниеИБ = Справочники.СостоянияИБ_ат.СоздатьЭлемент();
	СостояниеИБ.Наименование = "Архвная ИБ";
	СостояниеИБ.Записать();

	СостояниеИБ = Справочники.СостоянияИБ_ат.СоздатьЭлемент();
	СостояниеИБ.Наименование = "Не используется";
	СостояниеИБ.Записать();
	
КонецПроцедуры 

Процедура ВыполнитьНачальноеЗаполнениеСправочникаСодержанияРабот_ат()
	
	СодержаниеРабот = Справочники.СодержанияРабот_ат.СоздатьЭлемент();
	СодержаниеРабот.Наименование = "Планирование";
	СодержаниеРабот.Записать();

	СодержаниеРабот = Справочники.СодержанияРабот_ат.СоздатьЭлемент();
	СодержаниеРабот.Наименование = "Выезд";
	СодержаниеРабот.Записать();
	
	СодержаниеРабот = Справочники.СодержанияРабот_ат.СоздатьЭлемент();
	СодержаниеРабот.Наименование = "Документация";
	СодержаниеРабот.Записать();
	
КонецПроцедуры 

Процедура ВыполнитьНачальноеЗаполнениеСправочникаПараметрыКонтроляДанных_ат()
	
	КонтрольНаименований = Справочники.ПараметрыКонтроляДанных_ат.КонтролироватьНаименованияВСправочниках.ПолучитьОбъект();
	КонтрольНаименований.Исключения =
		"Справочник.ИдентификаторыОбъектовМетаданных; Справочник.ПоставкиПродуктов_ат; Справочник.ЭкземплярыПродуктов_ат;";
	КонтрольНаименований.Записать();
	
	ЗаполнениеРеквизитов = Справочники.ПараметрыКонтроляДанных_ат.ЗаполнятьОбщиеОбязательныеПоля.ПолучитьОбъект();
	ЗаполнениеРеквизитов.Использовать = Истина;
	ЗаполнениеРеквизитов.Записать();
	
КонецПроцедуры 

Процедура ВыполнитьНачальноеЗаполнениеПВХОбъектыНумераторов_ат()
	
	ОбъектНумератора = ПланыВидовХарактеристик.ОбъектыНумераторов_ат.СоздатьЭлемент();
	ОбъектНумератора.Наименование = "Договоры";
	ОбъектНумератора.ТипЗначения = Тип("СправочникСсылка.Договоры_ат");
	ОбъектНумератора.Записать();
	
КонецПроцедуры

Процедура ВыполнитьНачальноеЗаполнениеСправончникаПричиныПереносаОжидаемойДатыЗавершенияРабот_ат()
	
	Другое = Справочники.ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат.Другое.ПолучитьОбъект();
	Другое.Наименование = "Прочее";
	Другое.ДобавлятьКомментарий = Истина;
	Другое.Записать();
	
	ИзмененоВСогласовании = Справочники.ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат.ИзмененоВСогласовании.ПолучитьОбъект();
	ИзмененоВСогласовании.Наименование = "Изменено в согласовании";
	ИзмененоВСогласовании.Записать();
	
	ПоздняяОплата = Справочники.ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат.ПоздняяОплатаСчета.ПолучитьОбъект();
	ПоздняяОплата.Наименование = "Поздняя оплата по счету";
	ПоздняяОплата.Записать();
	
	ПозднееСогласование = Справочники.ПричиныПереносаОжидаемойДатыЗавершенияРабот_ат.ПозднееСогласование.ПолучитьОбъект();
	ПозднееСогласование.Наименование = "Позднее согласование";
	ПозднееСогласование.Записать();
	
КонецПроцедуры
